define(['jquery'] , function($){
	
	var explain = {
		//雨伞充电宝-活动说明
		1 : {
			explain : [
				'1.用户选择爱回收官方门店咨询店员，支付押金即可免费借用',
				'2.本服务提供借还物品的权益，每种类型的物品只能借用一件',
				'3.请与借用物品的指定时间内归还，归还时请保证物品的完整',
				'4.如果借用物品有严重损坏或是丢失，请按照物品价值赔偿给爱回收',
				'5.充电宝价值100元，雨伞价值50元',
			],
			smallTitle:">电子设备使用说明",
			others : [
				'1.请勿在高温或潮湿的环境中放置或使用，不可在阳光下暴晒（使用温度范围：充电0~45度），放电-10~60度，储存温度范围-20~60度',
				'2.严禁将产品投入火中或水中，以免发生火灾或是爆炸的危险',
				'3.为避免造成伤害或导致财务损失，不使用本品时请拔除电源输入线',
				'4.请将本品放置在小孩无法接触的地方',
				'5.如遇有液漏，起鼓等异常时，请勿继续使用。如有液体漏出不慎溅入眼睛，请勿揉擦，需立即用干净的水清洗眼睛，严重时请到医院就医'
			]
		},

		//干电池活动-说明
		2 : {
			explain : [
				'1.前往门店以旧电池更换新电池（5号、7号废旧电池）',
				'2.电池兑换：以门店实际型号为准',
				'3.可供每人每周兑换10节干电池，爱护环境人人有责',
			],
			smallTitle:">电子设备使用说明",
			others : [
				'1.请勿在高温或潮湿的环境中放置或使用，不可在阳光下暴晒',
				'2.严禁将产品投入火中或水中，以免发生火灾或是爆炸的危险',
				'3.请将本品放置在小孩无法接触的地方',
			]
		},

		//免费贴膜-活动说明
		3 : {
			explain : [
				'1.前往门店咨询店员，关注微信公众号，分享至朋友圈即可享受',
				'2.我们为您提供免费贴膜服务，型号支持：iPhone5/5S,iPhone6/plus,三星GalaxyS5,三星GalaxyNote4，小米4 （以门店实际型号为准）',
			],
			smallTitle:"",
			others : [

			]
		},

		//数据线-活动说明

		4 : {
			explain : [
				'前往爱回收门店进行购买。',
			],
			smallTitle:"产品简介与特性",
			others : [
				'简介：',
				'1、HALO BACK Lightning to USB数据线是通过苹果官方MFi认证的配件产品，可以帮助您将带有lightning接口的iPhone，iPad，iPod设备连接到电脑USB端口，完成充电和数据传输。也可以连接到苹果的USB电源适配器上方便地充电。',
				'&nbsp;',
				'特性：',
				'1.通过苹果官方MFi认证，PPID：127392-0197，传输数据不报错',
				'2.高纯度铜芯电芯，不发热，充电速度是普通数据线的3倍以上',
				'3.优质TPE线材，内含精密编织屏蔽网，韧性高，手感顺滑不扭结',
				'4.USB头采用铜质外壳，通过10000次插拔测试，使用寿命是普通数据线的3倍以上',
				'5.质保期18个月',
			]
		}
	}

	$(function(){
		var page = localStorage.getItem('page');
		var detail = explain[page],html="";

		for (var i = 0 , len = detail.explain.length; i < len; i++) {
			html += '<p class="">'+detail.explain[i]+'</p>';
		}

		detail.smallTitle ? html += '<p>&nbsp;</p><h3>'+detail.smallTitle+'</h3>' : void(0);

		for (var i = 0 , len = detail.others.length; i < len; i++) {
			html += '<p class="">'+detail.others[i]+'</p>';
		}
		
		html += '<p>&nbsp;</p><p>本活动最终解释权归爱回收所有<p>';

		$(".explain-desc").html(html).fadeIn();
	})
})